import Link from 'next/link'
import styles from './PageNews.module.css'



export const metadata = {
    title: "Post",
    description: "Post",
  };

export function PagePost({ params: { id } }) {

    return (
        <div className={styles.pageNews}>
            <Link href="http://localhost:3000" className={styles.backBtn}>Назад</Link>
            <h1 className={styles.newsTitle}>Italy v Argentina</h1>
            <div className={styles.newsInfo}>
                <p className={styles.newsDate}>24 July 2023, 11:07:40 AM</p>
                <a href='#' className={styles.linkGuardian}>read on Guardian</a>
            </div>
            <div className={styles.newsInfoMain}>
                <img className={styles.mainImg} />

                <div className={styles.mainContent}>
                    <h1 className={styles.mainTitle}>Название</h1>
                    <p className={styles.mainText}> Текст Текст Текст  Текст Текст Текст   Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст   Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст   Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст   Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст  Текст Текст Текст </p>
                </div>


            </div>
        </div>
    )
}

export default PagePost
